{
  "headTitle": "Blog – Lukasz Kurant",
  "title": "Blog",
  "description": "I care about knowledge sharing, so I am happy to share what I know.",
  "polishVersion": "🇵🇱 Polish version",
  "more": {
    "title": "Want more?",
    "description": "More articles will appear here soon."
  },
  "articles": {
    "article0": {
      "date": "November 8, 2019",
      "title": "Połączenie aplikacji React Native z usługą App Center 🇵🇱",
      "description": "Presentation of the functionality of the App Center tool and how to integrate it with React Native application."
    },
    "article1": {
      "date": "November 9, 2019",
      "title": "Push notyfikacje App Center 🇵🇱",
      "description": "Sending push notifications in a React Native application using the AppCenter push notifications service."
    },
    "article2": {
      "date": "November 9, 2019",
      "title": "Integracja aplikacji App Center z Bitbucket 🇵🇱",
      "description": "Integrating the Bitbucket repository with the AppCenter service."
    },
    "article3": {
      "date": "November 22, 2019",
      "title": "Narzędzia diagnostyczne i analityczne App Center 🇵🇱",
      "description": "Demonstration of the analytics module capabilities in a React Native application using AppCenter."
    },
    "article4": {
      "date": "October 22, 2019",
      "title": "Przyśpieszenie aplikacji w React Native 🇵🇱",
      "description": "A presentation of the Hermes engine, along with an indication of its effectiveness."
    },
    "article5": {
      "date": "February 20, 2020",
      "title": "Narzędzie diagnostyczne React Native Doctor 🇵🇱",
      "description": "Demonstration of react native doctor tool for finding and fixing issues related to the development environment."
    },
    "article6": {
      "date": "May 5, 2020",
      "title": "WatermelonDB in React Native (1/2)",
      "description": "The process of configuring the WatermelonDB library and creating table and model definitions."
    },
    "article7": {
      "date": "May 15, 2020",
      "title": "WatermelonDB in React Native (2/2)",
      "description": "Presentation of actions on data using WatermelonDB database. Creating, editing and deleting records in the database."
    },
    "article8": {
      "date": "March 27, 2021",
      "title": "Native components of Android in React Native",
      "description": "Creating a native Android component in Java and integrating it with a React Native application using a bridge."
    },
    "article9": {
      "date": "June 20, 2022",
      "title": "Semantic analysis in React Native using Tensorflow",
      "description": "Developing a mobile app to enable tone detection in movie reviews. Integrating Tensorflow into a React Native application and using a trained model based on a convolutional neural network."
    },
    "article10": {
      "date": "August 17, 2022",
      "title": "Real-time pose detection in React Native using MLKit",
      "description": "Real-time human pose detection using Frame processor with Vision camera."
    },
    "article11": {
      "date": "August 17, 2022",
      "title": "Creating native frame processors for Vision Camera in React Native using OpenCV",
      "description": "Real-time detection of colored objects using native code in Java and Objective-C."
    },
    "article12": {
      "date": "November 17, 2022",
      "title": "Regression algorithms in Javascript",
      "description": "Description and example of the use of linear and polynomial regression in Javascript."
    },
    "article13": {
      "date": "November 21, 2022",
      "title": "Dynamically change iOS app icons in React Native",
      "description": "Dynamically changing an app icon using a library in React Native."
    },
    "article14": {
      "date": "January 23, 2023",
      "title": "Conclusions of an indie developer after publishing his own application",
      "description": "This post describes my experience with developing my own mobile app."
    },
    "article15": {
      "date": "January 25, 2023",
      "title": "Using iCloud containers in a React Native application",
      "description": "Installation and use of an external library to manage iCloud containers in a React Native application."
    },
    "article16": {
      "date": "March 21, 2023",
      "title": "Association rules in JavaScript",
      "description": "The use of an Apriori algorithm to perform basket analysis."
    }
  }
}
